# CutLineAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CutMarkType..::..CutLineAngle Property
CutMarkType Class See Also
---
The rotation angle of the cut mark.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double CutLineAngle { get; set; }
```

Visual Basic
---
```text
Public Property CutLineAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CutLineAngle {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for rotationAngle is not finite |

# See Also
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace